# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'biber'
brew 'coreutils' # Those that come with macOS are outdated
brew 'direnv'
brew 'gh' # GitHub
brew 'git'
brew 'git-lfs'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mdv' markdown reader
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'pyenv-virtualenv' # virtual environment manager for python

# Apps
cask 'claude-code'
cask 'deepl'
cask 'discord'
cask 'firefox'
cask 'font-computer-modern'
cask 'mactex'
cask 'spotify'
cask 'zoom'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
